Ques1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [8]:
import pandas as pd

pd.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Ques2.Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
import pandas as pd

l1= [1,2,3,4,5,'sahil',7,8.0,'Rajput',10]

pd.Series(l1)

0         1
1         2
2         3
3         4
4         5
5     sahil
6         7
7       8.0
8    Rajput
9        10
dtype: object

Ques3. Create a Pandas DataFrame that contains the following data:

In [ ]:
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [7]:
import pandas as pd

data = {
         'Name' : ['Alice','Bob','Claire'],
        'Age' : [25,30,27],
        'Gender' : ['Female','Male','Female']
       }
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Ques4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans. A DataFrame in pandas is a two-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or a SQL table, where data is organized in rows and columns, and each column can have a different data type. A DataFrame can be thought of as a collection of Series objects, where each Series represents a column of the DataFrame.

A Series in pandas, on the other hand, is a one-dimensional labeled data structure with a homogeneous data type.

In [10]:
import pandas as pd

# create a Pandas Series
s = pd.Series([1, 2, 3, 4, 5])

df = pd.DataFrame({'Name' : ['Alice','Bob','Claire'],
        'Age' : [25,30,27],
        'Gender' : ['Female','Male','Female']})

print(s) # to print series

print(df) # to print data frame

0    1
1    2
2    3
3    4
4    5
dtype: int64
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Ques5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans. 1.head(): Returns the first 5 rows of the DataFrame. This is useful for quickly checking the data and making sure it is in the expected format.

2.tail():Returns the last 5 rows of the dataframe.

2.describe(): Generates descriptive statistics for numerical columns in the DataFrame, such as count, mean, standard deviation, minimum, maximum, and quartiles. This is useful for understa

In [12]:
import pandas as pd

df = pd.DataFrame({'Name' : ['Alice','Bob','Claire','Sahil','Mansi','Kajal','Tanu','Sona'],
        'Age' : [25,30,27,34,34,21,4,12],
        'Gender' : ['F','M','F','M','F','M','F','F']})
print(df)

     Name  Age Gender
0   Alice   25      F
1     Bob   30      M
2  Claire   27      F
3   Sahil   34      M
4   Mansi   34      F
5   Kajal   21      M
6    Tanu    4      F
7    Sona   12      F

In [13]:
df.head()

     Name  Age Gender
0   Alice   25      F
1     Bob   30      M
2  Claire   27      F
3   Sahil   34      M
4   Mansi   34      F

In [14]:
df.tail()

    Name  Age Gender
3  Sahil   34      M
4  Mansi   34      F
5  Kajal   21      M
6   Tanu    4      F
7   Sona   12      F

In [15]:
df.describe()

             Age
count   8.000000
mean   23.375000
std    10.662853
min     4.000000
25%    18.750000
50%    26.000000
75%    31.000000
max    34.000000

Ques6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans. In a Series, the data can be modified by assigning new values to individual elements using their index. 

DataFrame, we can modify values in cells, add or remove columns or rows, and perform various manipulations on the data.

In a Panel, the data can be modified by replacing the entire contents of a panel axis, but it is not possible to modify the shape of the panel. However, it is recommended to use the

Ques7. Create a DataFrame using multiple Series. Explain with an example.

In [16]:
import pandas as pd

name = pd.Series(['Alice', 'Bob', 'Claire'])
age = pd.Series([25, 30, 27])
gender = pd.Series(['Female', 'Male', 'Female'])

df = pd.DataFrame({'Name': name, 'Age': age, 'Gender': gender})

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female